[server]
port = 10086
golden_code = 292
open_mapping	= 1			; 是否使用映射的外网ip和端口
mapping_ip	= 127.0.0.1		; 外网网关ip(ip server 192.168)
mapping_port	= 10086  		; 映射端口


[world]
id = 200001				;游戏世界ID
name = Origins
section_id = 200000			;大区ID
section_name = loong
player_num_limit = 1500
save_num_per_tick = 1
role_level_limit = 120			;人物等级上限
pk_runaway_ticks = 300			;pk逃逸后，延迟下线时间

[db_server]
ip = 127.0.0.1
port = 5005
golden_code = 90100891

[login_server]
ip = 127.0.0.1
port = 5050
golden_code = 300

[gm_server]
ip = 127.0.0.1			;gmserver的ip
port = 6600			;gmserver的端口

[bill_server]
ip = 127.0.0.1		;billserver的ip
port = 7123			;billserver的端口

[CA_info]
area		=	HK
black_list	=	
certificate	=	D:\game\server_config\world\200001.dat

[CA_svrlist]
num = 2
ca_1 = 127.0.0.1
ca_2 = 127.0.0.1
port_1 = 7000
port_2 = 7000
 
[window]
width = 800				;窗口大小
height = 600				;窗口大小

[cheat]
lax_cheat_distance = 50			;外挂距离检测
strict_cheat_distance = 10		;外挂距离检测

[quest]					;任务属性的相关路径
path = data\system\quest
list = data\system\quest\quest.xml
acceptQuest_NPC_relation = data\system\quest\accept_quest_npc.data
completeQuest_NPC_relation = data\system\quest\complete_quest_npc.data

[loot]					;掉落属性的相关路径
creature_loot = data\system\attdata\loot_proto.xml
loot_item_set = data\system\attdata\loot_item_set_proto.xml
loot_quest_item = data\system\attdata\loot_quest_item_proto.xml

[script]				;脚本目录
path = server_data\script

[vip_netbar]				;金牌网吧路径
path = server_data\vip_netbar.xml


[house_keeping]			;清理
max_recv_wait_unit_num	= 64			;客户端等待处理的包的最大数量，超过数量将被踢掉
max_send_cast_unit_num	= 1000			;发送给客户端但还没有收到响应的包数量，超过数量将被踢掉
max_send_cast_size		= 2097152	;发送给客户端但还没有收到相应的字节数量，超过即被踢掉

[chat_log]
on = 1					;开启聊天log
channelflag = 255		;255(全开) 0(全关) 1(私聊) 128(除系统公告外，全关) 129(除系统和私聊外，全关)

[worldinfo]
enableexpresspay = 1								; 是否显示直冲按钮
expresspayurl = http://127.0.0.1:86						; 直冲的url
loginmode = 0									; 1为大陆，2为迅雷，0为新疆，3为台湾。
today_hot_activity_url	= http://127.0.0.1:86	; 今日热门活动URL


[spirit]
on = 0			; 精力系统是否开启
level = 40 		; 起效的级别
pointperminute = 1	; 离线恢复速度 点/分钟
reward	= 320		; 领奖点数

count = 4		; 精力对应的加成百分比个数
upper_bound_0 = 360	; 精力对应的加成百分比1
rate_0 = 120
upper_bound_1 = 300	; 精力对应的加成百分比2
rate_1 = 100
upper_bound_2 = 120	; 精力对应的加成百分比3
rate_2 = 75
upper_bound_3 = 60	; 精力对应的加成百分比4
rate_3 = 50

rewardcount = 2		; 领取奖品
reward_0 = 1352002	; 神龙鼎
reward_num_0 = 1	; 数量
reward_quality_0 = -1	; 品级
reward_1 = 1352003	; 龙珠
reward_num_1 = 1	; 数量
reward_quality_1  = -1	; 品级

strengthcount=2	; 实力可兑换物品数量
strength_0 = 6			; 实力值
strength_item_0 = 1000802	;  道具ID
strength_1 = 12			; 实力值
strength_item_1 = 1000803	;  道具ID

[pet]
packet_valve	= 10	; 宠物栏位个数

[preventlost]
offline_reward	= 1	; 离线奖励开关1为开；0即为关
loonglessing	= 1	; 神龙赐福开关1为开；0为关

[title]
title_num       = 355   ; 称号的最大个数

[arena]
on              = 1     ;  0为关闭竞技场，1为开放竞技场

[talent_show]
on              = 0     ;  0为关闭新疆选秀活动，1为开放选秀活动

[fabao]
on		= 1	; 0为关闭法宝相关处理，1为开

[create_role]
max_role_num    = 5     ;  创建玩家角色个数限制,防外挂

[city_struggle]		; 城战
on		= 1	; 1为开启城战，0为关闭城战

[soaring]
on		= 1	; 飞升开关

[auto_fight]
time_interval	= 1000	; 单位为毫秒

[meridian]
on		= 1	; 经脉开关
level_limit	= 50	; 角色等级最低限制，只有满足最低要求的角色才可以练习经脉技能

[meridian]
on		= 1	; 经脉开关
level_limit	= 50	; 角色等级最低限制，只有满足最低要求的角色才可以练习经脉技能

[guild_union]		; 公会相关
on		= 0	; 公会版本开启标志，1开启公会版，0关闭公会版

[mall_grouppurchase]	; 商城团购
on		= 1	; 商城团购开启标志，1开启商城团购，0关闭商城团购

[double_hit]            ; 连击功能
on              =  1    ; 连击功能开启标志，1开启连击功能，0关闭连击功能

[wardrobe]              ; 藏衣阁
on              =  1    ; 藏衣阁功能开启标志，1开启，0关闭


[duo_bao_qi_bing]
Sunday			= 1	;夺宝奇兵活动周日是否开放（0：关   1：开）
Monday			= 1	;夺宝奇兵活动周一是否开放（0：关   1：开）
Tuesday			= 1	;夺宝奇兵活动周二是否开放（0：关   1：开）
Wednesday		= 1	;夺宝奇兵活动周三是否开放（0：关   1：开）
Thursday		= 1	;夺宝奇兵活动周四是否开放（0：关   1：开）
Friday			= 1	;夺宝奇兵活动周五是否开放（0：关   1：开）
Saturday		= 1	;夺宝奇兵活动周六是否开放（0：关   1：开）

[god_bid]
on = 0			;		神之竞标系统开关（0：关   1：开）
FixedBidStartTimeCnt = 3;		每周固定竞标开始时间个数
FixedBidStartTime_1 = 12;		
FixedBidStartTime_2 = 19;		
FixedBidStartTime_3 = 22;		
WeekendAddedBidStartTimeCnt = 2;	周末加开的竞标开始时间个数
WeekendAddedBidStartTime_1 = 14;	
WeekendAddedBidStartTime_2 = 16;	


[egg_broker]
on = 1					;砸金蛋系统开关

[role_spreader]
on = 0					;游戏推广员开关